{
  "id": "MH1843-en-PT2-027",
  "number": 36,
  "title": "The Promise",
  "part": "Part II",
  "verses": [
    "1. Jesus my all to heaven is gone, Jesus says he\nHe whom I fix my hopes upon; will be with us to the end, For he has been with us, and he\nstill is with us, And he's promis'd to be with us to the end.",
    "2. His track I see and I'll pursue, Jesus, &c.\nThe narrow way till him I view. Jesus, &c.",
    "3. The way the holy prophets went, Jesus, &c.\nThe road that leads to banishment. Jesus, &c.",
    "4. The king's highway of holiness, Jesus, &c.\nI'll go, for all his paths are peace. Jesus, &c.",
    "5. This is the way I long have sought, Jesus, &c.\nAnd mourned because I found it not. Jesus &c.",
    "6. My grief a burden long has been, Jesus, &c.\nBecause I was not saved from sin. Jesus, &c.",
    "7. The more I strove against its power, Jesus, &c.\nI felt its weight and guilt the more. Jesus, &c.",
    "8. Till late I heard my Savior say, Jesus, &c.\n'Come hither soul, I am the way.' Jesus, &c.",
    "9. Lo! glad I come, and thou, blest Lamb, Jesus, &c.\nShall take me to thee, whose I am. Jesus, &c.",
    "10. Nothing but sin have I to give, Jesus, &c.\nNothing but love shall I receive. Jesus, &c.",
    "11. Then will I tell to sinners round, Jesus, &c.\nWhat a dear Savior I have found. Jesus, &c.",
    "12. I'll point to thy redeeming blood, Jesus, &c.\nAnd say, 'Behold the way of God.' Jesus, &c."
  ],
  "metadata": {
    "hymnal_id": "MH1843",
    "hymnal_title": "Millennial Harp",
    "language": "en",
    "page": 108,
    "year": 1843,
    "compiler": "Joshua V. Himes",
    "publisher": "Published at 14 Devonshire Street, Boston",
    "themes": ["Divine Promise", "Jesus as the Way", "Salvation Journey", "Redemption", "Evangelism"],
    "musical_notation": "Present with treble and bass clef",
    "tempo_marking": "",
    "hymnal_context": "Millerite/Adventist movement hymnal",
    "part": "Part II",
    "theological_significance": "Emphasizes Jesus as the way to salvation, the journey from sin to redemption, and the calling to share this good news with others"
  }
}