{
  "id": "MH1843-en-PT2-023",
  "number": 30,
  "title": "The Christian Band",
  "part": "Part II",
  "verses": [
    "1. Here is a band of brethren dear, I will be in this band, Hallelujah, Their leader calls them not to fear; I will be in this band, Hallelujah; I will be in this band, Hallelujah; In the Second Advent band, Hallelujah.",
    "2. As I was walking one day, I will be in this band, hallelujah; And thinking about this good old way, I will be in this band, hallelujah, I will be in this band, hallelujah.",
    "3. There was a voice which reached my soul, I will be in this band, hallelujah; Fear not, I make the wounded whole, I will be in this band, hallelujah; I will be in this band, hallelujah.",
    "4. My dungeon shook, my chains fell off, I will be in this band, hallelujah; My soul unfettered went aloft; I will be in this band, hallelujah; I will be in this band, hallelujah.",
    "5. I little thought he was so nigh, I will be in this band, hallelujah, He spoke and made me smile and cry; I will be in this band, hallelujah; I will be in this band, hallelujah.",
    "6. Now bless the Lord, I can proclaim, I will be in this band, hallelujah; That Jesus has made all things well; I will be in this band, hallelujah; I will be in this band, hallelujah.",
    "7. O shout my children, shout, you're free, I will be in this band, hallelujah, For Christ has bought your liberty! I will be in this band, hallelujah; I will be in this band, hallelujah.",
    "8. O bless the Lord, we need not fear, I will be in this band, hallelujah, For Daniel says he'll come this year; I will be in this band, hallelujah; I will be in this band, hallelujah.",
    "9. Both prophets and apostles too, I will be in this band, hallelujah; Their writings show this doctrine true; I will be in this band, hallelujah; I will be in this band, hallelujah."
  ],
  "metadata": {
    "hymnal_id": "MH1843",
    "hymnal_title": "Millennial Harp",
    "language": "en",
    "page": 102,
    "year": 1843,
    "compiler": "Joshua V. Himes",
    "publisher": "Published at 14 Devonshire Street, Boston",
    "themes": ["Christian Fellowship", "Second Advent", "Liberation", "Prophecy", "Biblical Authority"],
    "musical_notation": "Present with treble and bass clef",
    "tempo_marking": "",
    "hymnal_context": "Millerite/Adventist movement hymnal",
    "part": "Part II",
    "theological_significance": "Emphasizes unity in the Second Advent movement, references to Daniel's prophecies, and the joy of liberation through Christ"
  }
}