{
  "id": "HGPP-en-052",
  "number": 52,
  "title": "Are We Almost There?",
  "author": "[unclear]",
  "composer": "[unclear]",
  "tune": "[unclear]",
  "meter": "[unclear]",
  "language": "en",
  "verses": [
    {
      "number": 1,
      "text": "\"Are we almost there? Are we almost there?\"\nSays the weary saint, as he sighs for home;\n\"Are those the verdant trees that rear\nTheir stately forms' mid heav'n's bright dome?\""
    },
    {
      "number": 2,
      "text": "Then he talks of the flowers, the unsullied stream,\nThat flows through the Paradise of God;\nAnd he longs to wake from life's troubled dream,\nTo walk those golden streets abroad,"
    },
    {
      "number": 3,
      "text": "He is weary and sick, of this world's rude strife;\nAnd pants for a holy, peaceful clime;\nTo glow with the vigor of endless life,\nAnd be compass'd no more by the bounds of time."
    },
    {
      "number": 4,
      "text": "His eye is fix'd on the world to come,\nHe walks by faith through this vale of care,\nAnd oft inquires, as he draws near home,\nWith anxious heart, \"Are we almost there?\""
    },
    {
      "number": 5,
      "text": "For he's had an earnest of those joys\nWhich the righteous alone can ever share;\nHe turns with contempt from these earthly toys,\nAnd fervently asks—\"Are we almost there?\""
    },
    {
      "number": 6,
      "text": "Then lift up thine head, rejoice and be glad,\nFor in that bright world thou'lt never be sad;\nAnd thou shall pass from this world of strife\nTo the city fair, and the tree of life."
    },
    {
      "number": 7,
      "text": "Then lift up thy heart thou despairing saint,\nThe Lord will come, thou needs't not faint,\nFor the Lord's own hand shall wipe from thy face\nThe last lone tear, and speak to thee peace."
    }
  ],
  "metadata": {
    "year": 1849,
    "copyright": "Public Domain",
    "themes": [
      "longing for home",
      "pilgrimage",
      "paradise",
      "tree of life",
      "weary saint"
    ],
    "scripture_references": [
      "Rev 22:1-5",
      "Rev 21:4",
      "2 Cor 5:1-2"
    ],
    "tune_source": "[needs verification]",
    "original_language": "en",
    "hymnal_context": "Early Seventh-day Adventist movement"
  }
}