{
  "id": "HGPP-en-005",
  "number": 5,
  "title": "The Joys of Eden",
  "author": "[unclear]",
  "composer": "[unclear]",
  "tune": "[unclear]",
  "meter": "[unclear]",
  "language": "en",
  "verses": [
    {
      "number": 1,
      "text": "How sweet to reflect on those joys that await me\nIn yon blissful region, the haven of rest,\nWhere bright holy angels with welcome shall greet me.\nAnd lead me to mansions prepar'd for the blest.\nEncircled in light, and with glory enshrouded,\nMy happiness perfect, my mind's sky unclouded,\nI'll bathe in the ocean of pleasure unbounded,\nAnd range with delight through the Eden of Love."
    },
    {
      "number": 2,
      "text": "While angelic legions, with harps tun'd celestial,\nHarmoniously join in the concert of praise,\nThe saints, as they flock from the regions terrestrial,\nIn loud hallelujahs their voices will raise\nThen songs to the Lamb shall re—echo thro' heaven,\nMy soul will respond, to Immanuel be given,\nAll glory, all honor, all might and dominion,\nWho brought us through grace to the Eden of Love"
    },
    {
      "number": 3,
      "text": "Then hail, blessed state! hail, ye songsters of glory!\nYe harpers of bliss, soon I'll meet you above,\nAnd join your full choir in rehearsing the story,\n\"Salvation from sorrow, through Jesus' love:\"\nThough 'prison'd in earth, yet, by anticipation,\nAlready my soul feels a sweet prelibation\nOf joys that await me, when freed from probation:\nMy heart's now in heaven, the Eden, of Love."
    }
  ],
  "metadata": {
    "year": 1849,
    "copyright": "Public Domain",
    "themes": ["heaven", "eternal joy", "Eden restored", "heavenly worship", "angelic legions", "salvation through Jesus", "anticipation of glory"],
    "scripture_references": ["Revelation 21:1-4", "Isaiah 51:3", "Revelation 5:11-14"],
    "tune_source": "[needs verification]",
    "original_language": "en",
    "hymnal_context": "Early Seventh-day Adventist movement, James White compilation",
    "theological_significance": "Expression of Millerite hope for imminent heavenly reward and restored Eden",
    "page": 4
  }
}