{
  "id": "HSAB-en-024",
  "number": 24,
  "title": "Be Patient",
  "language": "en",
  "verses": [
    {
      "number": 1,
      "text": "BE patient, be patient, no longer despairing,\nThough bright hope deferred fills with sorrow thy heart\nTho' bitter the cup that thy soul has been sharing,\nLet not fond affections from Heaven depart.\nNot long will He tarry, in doubt here us leaving,\nHe'll come for his children who for him are grieving\nO wait for the promise, of glory receiving\nWhen the King in his beauty for us shall appear."
    },
    {
      "number": 2,
      "text": "Be patient, be patient, the light shining o'er thee,\nTho' guide thro' the shades that encompass the way\nThe Saviour has trod the rough pathway before thee,\nLet not earth's enchantments allure thee astray.\nUpward to God be the heart's adoration,\nWhere ever is flowing pure streams of salvation.\nRedemption is nearing! O, seek preparation!\nSoon the King in his beauty for us will appear."
    },
    {
      "number": 3,
      "text": "Be patient, be patient, a pilgrim and stranger,\nThough foes may assail, and the scoffing deride.\nThrough toil and affliction, temptation and danger,\nThe saints must be purified, made white and tried.\nBe humble, the spirit of meekness adorning,\nBe faithful proclaiming the last notes of warning,\nBe watchful, to hail the glad dawn of that morning,\nWhen the King in his beauty for us shall appear."
    },
    {
      "number": 4,
      "text": "Be patient, be patient, a little while longer,\nAnd Jesus the kingdom to us will restore.\nBe cheerful, enduring, thy faith growing stronger,\nTill trials are passed, and thy conflicts are o'er.\nBe patient, the Lord all his saints will deliver,\nWith love, peace and joy, be surrounded for ever,\nWhere nought shall o'er cloud or their sweet union sever,\nWith the King in his beauty they'll reign evermore."
    }
  ],
  "chorus": {
    "text": "Be patient, be patient"
  },
  "metadata": {
    "year": 1852,
    "copyright": "Public Domain",
    "publisher": "James White",
    "location": "Rochester, N.Y.",
    "themes": ["second advent", "patience", "endurance", "pilgrimage", "hope deferred"],
    "original_language": "en",
    "has_chorus": true
  }
}