{
  "id": "SDAH-en-347",
  "number": 347,
  "title": "Built on the Rock",
  "author": "Nikolai F. S. Grundtvig",
  "composer": "Ludvig M. Lindeman",
  "tune": "KIRKEN DEN ER ET GAMMELT HUS",
  "meter": "8.8.8.8.8.8",
  "language": "en",
  "verses": [
    {
      "number": 1,
      "text": "Built on the Rock the Church shall stand, Even when steeples are falling; Crumbled have spires in every land, Bells still are chiming and calling; Calling the young and old to rest, Calling the souls of those distressed, Longing for life everlasting."
    },
    {
      "number": 2,
      "text": "Not in our temples made with hands God, the Almighty, is dwelling; High in the heav'ns His temple stands, All earthly temples excelling; Yet He who dwells in heav'n above Deigns to abide with us in love, Making our bodies His temple."
    },
    {
      "number": 3,
      "text": "We are God's house of living stones, Built for His own habitation; He fills our hearts, His humble thrones, Granting us life and salvation; Were two or three to seek His face, He in their midst would show His grace, Blessings upon them bestowing."
    },
    {
      "number": 4,
      "text": "Yet in this house, an earthly frame, Jesus the children is blessing; Hither we come to praise His name, Faith in our Savior confessing; Jesus to us His Spirit sent, Making with us His covenant, Granting His children the kingdom."
    },
    {
      "number": 5,
      "text": "Through all the passing years, O Lord, Grant that, when church bells are ringing, Many may come to hear God's Word Where He this promise is bringing: I know My own, My own know Me; You, not the world, My face shall see; My peace I leave with you. Amen."
    }
  ],
  "chorus": null,
  "metadata": {
    "year": 1837,
    "copyright": null,
    "themes": ["Church", "Foundation", "Rock", "Temple", "Worship"],
    "scripture_references": ["Matthew 16:18", "1 Corinthians 3:16", "Matthew 18:20"],
    "tune_source": "Ludvig M. Lindeman",
    "original_language": "da"
  }
}